Horrorscope-backend/lib/api_communicator.rb

  def self.fetch_capricorn_horoscope
    url = "http://ohmanda.com/api/horoscope/capricorn/"
    resp = RestClient.get(url)
    horoscope_info = JSON.parse(resp)
    Horoscope.find_or_create_by(date: horoscope_info["date"], daily_horoscope: horoscope_info["horoscope"], sign_id: 1)
---
INSERT INTO "horoscopes" ("date", "daily_horoscope", "sign_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT  "horoscopes".* FROM "horoscopes" WHERE "horoscopes"."date" = $1 AND "horoscopes"."daily_horoscope" = $2 AND "horoscopes"."sign_id" = $3 LIMIT $4

  def self.fetch_aquarius_horoscope
    url = "http://ohmanda.com/api/horoscope/aquarius/"
    resp = RestClient.get(url)
    horoscope_info = JSON.parse(resp)
    Horoscope.find_or_create_by(date: horoscope_info["date"], daily_horoscope: horoscope_info["horoscope"], sign_id: 2)
---
INSERT INTO "horoscopes" ("date", "daily_horoscope", "sign_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT  "horoscopes".* FROM "horoscopes" WHERE "horoscopes"."date" = $1 AND "horoscopes"."daily_horoscope" = $2 AND "horoscopes"."sign_id" = $3 LIMIT $4

  def self.fetch_pisces_horoscope
    url = "http://ohmanda.com/api/horoscope/pisces/"
    resp = RestClient.get(url)
    horoscope_info = JSON.parse(resp)
    Horoscope.find_or_create_by(date: horoscope_info["date"], daily_horoscope: horoscope_info["horoscope"], sign_id: 3)
---
INSERT INTO "horoscopes" ("date", "daily_horoscope", "sign_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT  "horoscopes".* FROM "horoscopes" WHERE "horoscopes"."date" = $1 AND "horoscopes"."daily_horoscope" = $2 AND "horoscopes"."sign_id" = $3 LIMIT $4

  def self.fetch_aries_horoscope
    url = "http://ohmanda.com/api/horoscope/aries/"
    resp = RestClient.get(url)
    horoscope_info = JSON.parse(resp)
    Horoscope.find_or_create_by(date: horoscope_info["date"], daily_horoscope: horoscope_info["horoscope"], sign_id: 4)
---
INSERT INTO "horoscopes" ("date", "daily_horoscope", "sign_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT  "horoscopes".* FROM "horoscopes" WHERE "horoscopes"."date" = $1 AND "horoscopes"."daily_horoscope" = $2 AND "horoscopes"."sign_id" = $3 LIMIT $4

  def self.fetch_taurus_horoscope
    url = "http://ohmanda.com/api/horoscope/taurus/"
    resp = RestClient.get(url)
    horoscope_info = JSON.parse(resp)
    Horoscope.find_or_create_by(date: horoscope_info["date"], daily_horoscope: horoscope_info["horoscope"], sign_id: 5)
---
INSERT INTO "horoscopes" ("date", "daily_horoscope", "sign_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT  "horoscopes".* FROM "horoscopes" WHERE "horoscopes"."date" = $1 AND "horoscopes"."daily_horoscope" = $2 AND "horoscopes"."sign_id" = $3 LIMIT $4

  def self.fetch_gemini_horoscope
    url = "http://ohmanda.com/api/horoscope/gemini/"
    resp = RestClient.get(url)
    horoscope_info = JSON.parse(resp)
    Horoscope.find_or_create_by(date: horoscope_info["date"], daily_horoscope: horoscope_info["horoscope"], sign_id: 6)
---
INSERT INTO "horoscopes" ("date", "daily_horoscope", "sign_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT  "horoscopes".* FROM "horoscopes" WHERE "horoscopes"."date" = $1 AND "horoscopes"."daily_horoscope" = $2 AND "horoscopes"."sign_id" = $3 LIMIT $4

  def self.fetch_cancer_horoscope
    url = "http://ohmanda.com/api/horoscope/cancer/"
    resp = RestClient.get(url)
    horoscope_info = JSON.parse(resp)
    Horoscope.find_or_create_by(date: horoscope_info["date"], daily_horoscope: horoscope_info["horoscope"], sign_id: 7)
---
INSERT INTO "horoscopes" ("date", "daily_horoscope", "sign_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT  "horoscopes".* FROM "horoscopes" WHERE "horoscopes"."date" = $1 AND "horoscopes"."daily_horoscope" = $2 AND "horoscopes"."sign_id" = $3 LIMIT $4

  def self.fetch_leo_horoscope
    url = "http://ohmanda.com/api/horoscope/leo/"
    resp = RestClient.get(url)
    horoscope_info = JSON.parse(resp)
    Horoscope.find_or_create_by(date: horoscope_info["date"], daily_horoscope: horoscope_info["horoscope"], sign_id: 8)
---
INSERT INTO "horoscopes" ("date", "daily_horoscope", "sign_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT  "horoscopes".* FROM "horoscopes" WHERE "horoscopes"."date" = $1 AND "horoscopes"."daily_horoscope" = $2 AND "horoscopes"."sign_id" = $3 LIMIT $4

  def self.fetch_virgo_horoscope
    url = "http://ohmanda.com/api/horoscope/virgo/"
    resp = RestClient.get(url)
    horoscope_info = JSON.parse(resp)
    Horoscope.find_or_create_by(date: horoscope_info["date"], daily_horoscope: horoscope_info["horoscope"], sign_id: 9)
---
INSERT INTO "horoscopes" ("date", "daily_horoscope", "sign_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT  "horoscopes".* FROM "horoscopes" WHERE "horoscopes"."date" = $1 AND "horoscopes"."daily_horoscope" = $2 AND "horoscopes"."sign_id" = $3 LIMIT $4

  def self.fetch_libra_horoscope
    url = "http://ohmanda.com/api/horoscope/libra/"
    resp = RestClient.get(url)
    horoscope_info = JSON.parse(resp)
    Horoscope.find_or_create_by(date: horoscope_info["date"], daily_horoscope: horoscope_info["horoscope"], sign_id: 10)
---
INSERT INTO "horoscopes" ("date", "daily_horoscope", "sign_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT  "horoscopes".* FROM "horoscopes" WHERE "horoscopes"."date" = $1 AND "horoscopes"."daily_horoscope" = $2 AND "horoscopes"."sign_id" = $3 LIMIT $4

  def self.fetch_scorpio_horoscope
    url = "http://ohmanda.com/api/horoscope/scorpio/"
    resp = RestClient.get(url)
    horoscope_info = JSON.parse(resp)
    Horoscope.find_or_create_by(date: horoscope_info["date"], daily_horoscope: horoscope_info["horoscope"], sign_id: 11)
---
INSERT INTO "horoscopes" ("date", "daily_horoscope", "sign_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT  "horoscopes".* FROM "horoscopes" WHERE "horoscopes"."date" = $1 AND "horoscopes"."daily_horoscope" = $2 AND "horoscopes"."sign_id" = $3 LIMIT $4

  def self.fetch_sagittarius_horoscope
    url = "http://ohmanda.com/api/horoscope/sagittarius/"
    resp = RestClient.get(url)
    horoscope_info = JSON.parse(resp)
    Horoscope.find_or_create_by(date: horoscope_info["date"], daily_horoscope: horoscope_info["horoscope"], sign_id: 12)
---
INSERT INTO "horoscopes" ("date", "daily_horoscope", "sign_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT  "horoscopes".* FROM "horoscopes" WHERE "horoscopes"."date" = $1 AND "horoscopes"."daily_horoscope" = $2 AND "horoscopes"."sign_id" = $3 LIMIT $4