Horrorscope-backend/app/controllers/horoscopes_controller.rb

SELECT "horoscopes".* FROM "horoscopes"
---
  def index
    horoscopes = Horoscope.all