Horrorscope-backend/app/controllers/retrogrades_controller.rb

SELECT "retrogrades".* FROM "retrogrades"
---
  def index
    retrogrades = Retrograde.all