Horrorscope-backend/app/controllers/signs_controller.rb

  def index
    signs = Sign.all
---
SELECT "signs".* FROM "signs"

  def show
      sign = Sign.find(params[:id])
      horoscopes = sign.horoscopes.map{|horoscope| {id:horoscope.id, date: horoscope.date, daily_horoscope: horoscope.daily_horoscope, sign_id: horoscope.sign_id}}
      retrogrades = sign.retrogrades.map{|retrograde| {id:retrograde.id, sign_id: retrograde.sign_id, name: retrograde.name, explanation: retrograde.explanation}}
---
SELECT  "signs".* FROM "signs" WHERE "signs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "horoscopes".* FROM "horoscopes" WHERE "horoscopes"."sign_id" = $1  [["sign_id", 1]]
SELECT "retrogrades".* FROM "retrogrades" WHERE "retrogrades"."sign_id" = $1  [["sign_id", 2]]